Revit 2026 API

# TableDataWidth Property

---

Gets or sets the table width in feet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Width { get; set; }
```
```vb
Public Property Width As Double
	Get
	Set
```
```cpp
public:
property double Width {
	double get ();
	void set (double value);
}
```
```fsharp
member Width : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The table width is outside of the acceptable range. |

#### Reference

TableData Class

Autodesk.Revit.DB Namespace